# function of the dictionary for unicness
def number_to_words(number):
    words = [
        "ноль", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять",
        "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать",
        "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"
    ]
# comparison with the unicness
if number < 20:
        print(f"Число {number} прописью: {number_to_words(number)}")
    # divide a number to 2 parts: 10 (при делении на 10 окр) +1 (ост от дел)
    else:
        tens = ["двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
        units = ["один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
        return f"{tens[n // 10]} {units[n % 10]}"

print("Введите число от 0 до 99:")
user_input = input("Введите число от 0 до 99: ")
# смотрим: лежит ли в диапазоне, число ли это вообще
if user_input.numeralornot():
        number = int(user_input)
if 0 <= number < 100:
            print(f"Число {number} прописью: {number_to_words(number)}")
else:
            print("Ошибка: число должно быть от 0 до 99.")
 else:
        print("Ошибка: введена неправильная строка. Пожалуйста, введите число.")







